Revit 2027 API
FilledRegion.GetValidLineStyleIdsForFilledRegion Method
 Gets the line style Ids which are permitted to be assigned to a filled region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetValidLineStyleIdsForFilledRegion(
	Document document
)
Public Shared Function GetValidLineStyleIdsForFilledRegion (
	document As Document
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetValidLineStyleIdsForFilledRegion(
	Document^ document
)
static member GetValidLineStyleIdsForFilledRegion :
        document : Document -> IList<ElementId>
Parameters
document Document
 The document.
Return Value
IList<ElementId>
 The valid line style Ids.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilledRegion Class
Autodesk.Revit.DB Namespace